#+TITLE: Emacs configuration file
#+AUTHOR: Vignesh Ganapathiraman
#+BABEL: :cache yes
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{inconsolata}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+PROPERTY: header-args :tangle yes
*** Org mode
    1. *Babel*: Org babel lets you to write and execute a lot of
       languages within org mode
       #+BEGIN_SRC emacs-lisp
       ;; active Babel languages
       (use-package org
         :defer t
         :config
           (org-babel-do-load-languages
           'org-babel-load-languages
           '((R . t)
           (emacs-lisp . t)
                 (matlab . t)
                 (latex . t)
           (python . t)))

           ;; When editing org-files with source-blocks, we want the source
           ;; blocks to be themed as they would in their native mode.

           (setq org-src-fontify-natively t
                 ;; org-src-tab-acts-natively t
                 org-confirm-babel-evaluate nil
                 org-adapt-indentation t
                 org-hide-leading-stars nil
                 )
           )
       #+END_SRC
    2. Some default configs while editing files in org mode
       #+BEGIN_SRC emacs-lisp
       ;; (add-hook 'org-mode-hook 'auto-fill-mode)
       (add-hook 'org-mode-hook 'org-indent-mode)
       #+END_SRC
    3. Evil-org provides much needed navigation in org mode
       #+BEGIN_SRC emacs-lisp
       (use-package evil-org
         :ensure t
         :after org
         :defer t
         :config
         (add-hook 'org-mode-hook 'evil-org-mode)
         (add-hook 'evil-org-mode-hook
                   (lambda ()
                     (evil-org-set-key-theme))))
       #+END_SRC
    4. Reference management using org-ref 
       #+BEGIN_SRC emacs-lisp
       (use-package org-ref
         :ensure t
         :defer t
         :after org
         :config
         (setq bibtex-completion-bibliography "~/Dropbox/bibliography/references_zotero.bib")
         )
       #+END_SRC
    5. Org pandoc : conversion between several formats via org-export
       #+BEGIN_SRC emacs-lisp 
       (use-package ox-pandoc
         :ensure t
         :defer t)
       #+END_SRC
    6. Ox reveal for amazing presentations 
       #+BEGIN_SRC emacs-lisp
       (use-package ox-reveal
         :ensure ox-reveal)

       ;; (setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")
       (setq org-reveal-root "file:////Users/z0041v0/Downloads/reveal.js")
       (setq org-reveal-mathjax t)

       (use-package htmlize
         :ensure t)
       #+END_SRC

       #+RESULTS:
    7. Org agenda 
        #+BEGIN_SRC emacs-lisp
        (setq org-agenda-files
              '("~/Documents/org/notes.org"))

        #+END_SRC

